{
    "products": [{
            "_id": "iphone11",
            "title": "Iphone 11",
            "image": "https://cdn.cellphones.com.vn/media/catalog/product/cache/7/image/9df78eab33525d08d6e5fb8d27136e95/i/p/iphone11-purple-select-2019.png",
            "description": "Apple iPhone 11 là 1 trong bộ 3 iPhone được Apple thiết kế, phát triển và bán trên thị trường, ra mắt vào sự kiện ngày 10 tháng 9 năm 2019 cùng với iPhone 11 Pro và iPhone 11 Pro Max tại Nhà hát Steve Jobs trong công viên Apple Park bởi CEO Tim Cook. iPhone 11 là phiên bản kế nhiệm của iPhone XR, với giá bán chỉ là 699 USD, rẻ hơn 50 USD so với iPhone XR. iPhone 11 được trang bị CPU tiên tiến nhất Apple A13 Bionic cùng với camera kép với tính năng chụp góc siêu rộng.Tuy nhiên iPhone 11 chỉ được trang bị sẵn sạc phổ thông 5W trong hộp giống với các thế hệ iPhone tiền nhiệm. Trong khi iPhone 11 Pro và 11 Pro Max được trang bị sạc nhanh 18W, mặc dù 3 phiên bản này đều sỡ hữu công nghệ sạc nhanh. iPhone 11 được đặt trước từ 13/09/2019 và chính thức mở bán tại Apple Store từ 20/09/2019. iPhone 11 được đánh giá cao với sức mua lớn đến từ thị trường, đặc biệt là thị trường Trung Quốc. Kết thúc năm 2019, iPhone 11 trở thành smartphone bán chạy thứ 2 thế giới (với 37.3 triệu máy), sau iPhone XR (với 46.3 triệu máy).",
            "price": 16,
            "availableColor": ["Grey", "Red"]
        },
        {
            "_id": "iphone11promax",
            "title": "Iphone 11 Pro Max",
            "image": "https://cdn.cellphones.com.vn/media/catalog/product/cache/7/image/9df78eab33525d08d6e5fb8d27136e95/i/p/iphone-11-pro-max-space-select-2019.png",
            "description": "iPhone 11 Pro và iPhone 11 Pro Max là bộ đôi điện thoại thông minh do Apple Inc. thiết kế, phát triển và kinh doanh trên thị trường. Nó được công bố bởi CEO Tim Cook, cùng với chiếc iPhone 11. Mẫu máy này là sản phẩm kế nhiệm cho bộ đôi iPhone XS và iPhone XS Max. Sản phẩm chính thức được phát hành trên toàn thế giới vào ngày 20 tháng 9 năm 2019. Đây là lần đầu tiên Apple có sự phân cấp giữa các dòng iPhone. Trong đó iPhone 11 được coi là phiên bản tiêu chuẩn và bộ đôi iPhone 11 Pro được coi là phiên bản chuyên nghiệp và cao cấp hơn.",
            "price": 23,
            "availableColor": ["Grey", "Red"]
        },
        {
            "_id": "iphonexr",
            "title": "Iphone Xr",
            "image": "https://clickbuy.com.vn/uploads/2019/03/apple-iphone-xr-vang.png",
            "description": "iPhone XR (hay iPhone Xr, chữ số La Mã \"X\" phát âm là \"ten\", tiếng Việt là \"mười\") là smartphone được thiết kế và sản xuất bởi Apple Inc, được công bố vào sự kiện ngày 12 tháng 9 năm 2018 tại Nhà hát Steve Jobs trong khuôn viên Apple Park cùng với iPhone XS và iPhone XS Max. Khách hàng được đặt hàng trước bắt đầu vào ngày 19 tháng 10 năm 2018, mở bán chính thức vào ngày 26 tháng 10 năm 2018. iPhone XR sở hữu màn hình IPS LCD \"Liquid Retina\" 6.1 inch, được Apple tuyên bố là \"tiên tiến nhất và màu sắc chính xác trong ngành công nghiệp\". Đây là thiết bị rẻ nhất trong bộ ba iPhone 2018 của Apple, với mức giá khởi điểm là 749 USD, 1029 đô la ở Canada, 749 bảng ở Anh, 849 euro ở các nước Châu Âu và 6499 nhân dân tệ ở Trung Quốc. Nó có bộ vi xử lý tương tự XS và XS Max là Apple A12 Bionic được xây dựng theo tiến trình 7 nm. Apple tuyên bố rằng A12 Bionic là \"vi xử lý thông minh nhất và mạnh nhất\" từng được đưa vào điện thoại thông minh.",
            "price": 11,
            "availableColor": ["Grey", "Red", "Yellow"]
        },
        {
            "_id": "iphonex",
            "title": "Iphone X",
            "image": "https://www.xtmobile.vn/vnt_upload/product/04_2018/thumbs/600_ip_X_white_800x800_3.jpg",
            "description": "iPhone X là một điện thoại thông minh được Apple Inc. thiết kế, phát triển và đưa ra thị trường vào ngày 3 tháng 11 năm 2017. Nó được Giám đốc điều hành Tim Cook công bố vào ngày 12 tháng 9 năm 2017, cùng với iPhone 8 và iPhone 8 Plus tại Nhà hát Steve Jobs của Apple Park. Sản phẩm được đặt tên là iPhone X để kỷ niệm 10 năm iPhone, với chữ X là chữ số La Mã cho số 10. Trong mô hình của Apple, phiên bản X được định vị như một mô hình cao cấp, nhằm giới thiệu công nghệ tiên tiến. Các rò rỉ, bao gồm cả từ những nhà sản xuất, với HomePod firmware và phiên bản cuối cùng của iOS 11, cho thấy nhiều khía cạnh của sản phẩm này trước khi nó ra mắt, bao gồm thực tế là nó sẽ có một thiết kế gần như không có viền bezel (viền màn hình) và không có nút home vật lý, màn hình OLED, máy ảnh kép với cảm biến độ sâu được nâng cao và hệ thống nhận diện khuôn mặt được biết đến với cái tên Face ID.",
            "price": 10.5,
            "availableColor": ["Grey", "Red"]
        },
        {
            "_id": "iphonexsmax",
            "title": "Iphone XS Max",
            "image": "https://cdn.tgdd.vn/Products/Images/42/190321/iphone-xs-max-gold-600x600.jpg",
            "description": "iPhone XS và iPhone XS Max (cách điệu: iPhone Xs và iPhone Xs Max; Số La Mã \"X\", được đọc là \"mười\") là các mẫu smartphone do công ty Apple Inc. thiết kế, phát triển và kinh doanh trên thị trường. Đây là thế hệ thứ 12 trong các dòng flagship iPhone. Bộ đôi này được ra mắt vào 10h ngày 12 tháng 9 năm 2018 (0h ngày 13/09/2018 theo giờ Việt Nam) tại Nhà hát Steve Jobs trong công viên Apple Park bởi CEO Tim Cook. Apple cho đặt trước iPhone Xs, Xs Max từ ngày 14 tháng 9 năm 2018 và chính thức phát hành vào ngày 21 tháng 9 năm 2018 cùng với iPhone XR. iPhone Xs Max hiện là chiếc điện thoại có màn hình lớn nhất và giá thành cao nhất của Apple tính đến thời điểm nó ra mắt.",
            "price": 10.5,
            "availableColor": ["Grey", "Red"]
        },
        {
            "_id": "iphonexs",
            "title": "Iphone XS",
            "image": "https://www.thegioididong.com/images/42/190323/iphone-xs-gold-600x600-2-400x400.jpg",
            "description": "iPhone XS và iPhone XS Max (cách điệu: iPhone Xs và iPhone Xs Max; Số La Mã \"X\", được đọc là \"mười\") là các mẫu smartphone do công ty Apple Inc. thiết kế, phát triển và kinh doanh trên thị trường. Đây là thế hệ thứ 12 trong các dòng flagship iPhone. Bộ đôi này được ra mắt vào 10h ngày 12 tháng 9 năm 2018 (0h ngày 13/09/2018 theo giờ Việt Nam) tại Nhà hát Steve Jobs trong công viên Apple Park bởi CEO Tim Cook. Apple cho đặt trước iPhone Xs, Xs Max từ ngày 14 tháng 9 năm 2018 và chính thức phát hành vào ngày 21 tháng 9 năm 2018 cùng với iPhone XR. iPhone Xs Max hiện là chiếc điện thoại có màn hình lớn nhất và giá thành cao nhất của Apple tính đến thời điểm nó ra mắt.",
            "price": 10.5,
            "availableColor": ["Grey", "Red"]
        }
    ]
}